{"class_name": "Sequential", "config": [{"config": {"b_constraint": null, "nb_filter": 24, "batch_input_shape": [null, 66, 200, 3], "trainable": true, "input_dtype": "float32", "name": "convolution2d_10", "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 36, "trainable": true, "name": "convolution2d_21", "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 48, "trainable": true, "name": "convolution2d_32", "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 64, "trainable": true, "name": "convolution2d_43", "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 64, "trainable": true, "name": "convolution2d_54", "activity_regularizer": null, "border_mode": "valid", "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_15", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_16", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "batch_input_shape": [null, 1152], "trainable": true, "input_dim": 1152, "W_constraint": null, "name": "dense_17", "activity_regularizer": null, "W_regularizer": null, "bias": true, "input_dtype": "float32", "output_dim": 100, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "batch_input_shape": [null, 100], "trainable": true, "input_dim": 100, "W_constraint": null, "name": "dense_28", "activity_regularizer": null, "W_regularizer": null, "bias": true, "input_dtype": "float32", "output_dim": 50, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "batch_input_shape": [null, 50], "trainable": true, "input_dim": 50, "W_constraint": null, "name": "dense_39", "activity_regularizer": null, "W_regularizer": null, "bias": true, "input_dtype": "float32", "output_dim": 10, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_210", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "batch_input_shape": [null, 10], "trainable": true, "input_dim": 10, "W_constraint": null, "name": "dense_411", "activity_regularizer": null, "W_regularizer": null, "bias": true, "input_dtype": "float32", "output_dim": 1, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.1"}